zixxenK/Tank-robot/firmware/stm32_chassis/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BATTERY_Pin GPIO_PIN_0
#define BATTERY_GPIO_Port GPIOB
#define SERIAL_SERVO_TX_EN_Pin GPIO_PIN_7
#define SERIAL_SERVO_TX_EN_GPIO_Port GPIOE
#define SERIAL_SERVO_RX_EN_Pin GPIO_PIN_8
#define SERIAL_SERVO_RX_EN_GPIO_Port GPIOE
#define TIM1_CH1_Pin GPIO_PIN_9
#define TIM1_CH1_GPIO_Port GPIOE
#define LED_SYS_Pin GPIO_PIN_10
#define LED_SYS_GPIO_Port GPIOE
#define TIM1_CH2_Pin GPIO_PIN_11
#define TIM1_CH2_GPIO_Port GPIOE
#define TIM1_CH3_Pin GPIO_PIN_13
#define TIM1_CH3_GPIO_Port GPIOE
#define TIM1_CH4_Pin GPIO_PIN_14
#define TIM1_CH4_GPIO_Port GPIOE
#define IMU_ITR_Pin GPIO_PIN_12
#define IMU_ITR_GPIO_Port GPIOB
#define IMU_ITR_EXTI_IRQn EXTI15_10_IRQn
#define MASTER_TX_Pin GPIO_PIN_8
#define MASTER_TX_GPIO_Port GPIOD
#define MASTER_RX_Pin GPIO_PIN_9
#define MASTER_RX_GPIO_Port GPIOD
#define LCD_BLK_Pin GPIO_PIN_11
#define LCD_BLK_GPIO_Port GPIOD
#define LCD_CS_Pin GPIO_PIN_12
#define LCD_CS_GPIO_Port GPIOD
#define LCD_DC_Pin GPIO_PIN_13
#define LCD_DC_GPIO_Port GPIOD
#define LCD_RES_Pin GPIO_PIN_14
#define LCD_RES_GPIO_Port GPIOD
#define SERIAL_SERVO_TX_Pin GPIO_PIN_6
#define SERIAL_SERVO_TX_GPIO_Port GPIOC
#define SERIAL_SERVO_RX_Pin GPIO_PIN_7
#define SERIAL_SERVO_RX_GPIO_Port GPIOC
#define HC_SR04_TRIG_Pin GPIO_PIN_8
#define HC_SR04_TRIG_GPIO_Port GPIOC
#define HC_SR04_ECHO_Pin GPIO_PIN_12
#define HC_SR04_ECHO_GPIO_Port GPIOA
/* Retain generated names for legacy code.  PA12 is now reserved for the
 * HC-SR04 ECHO input; PC9 is left unused rather than driven as a servo. */
#define PWM_SERVO_3_Pin HC_SR04_TRIG_Pin
#define PWM_SERVO_3_GPIO_Port HC_SR04_TRIG_GPIO_Port
#define PWM_SERVO_4_Pin GPIO_PIN_9
#define PWM_SERVO_4_GPIO_Port GPIOC
#define BUZZER_Pin GPIO_PIN_8
#define BUZZER_GPIO_Port GPIOA
#define PWM_SERVO_1_Pin GPIO_PIN_11
#define PWM_SERVO_1_GPIO_Port GPIOA
#define PWM_SERVO_2_Pin HC_SR04_ECHO_Pin
#define PWM_SERVO_2_GPIO_Port HC_SR04_ECHO_GPIO_Port
#define SBUS_RX_Pin GPIO_PIN_2
#define SBUS_RX_GPIO_Port GPIOD
#define BLE_TX_Pin GPIO_PIN_5
#define BLE_TX_GPIO_Port GPIOD
#define BLE_RX_Pin GPIO_PIN_6
#define BLE_RX_GPIO_Port GPIOD
#define KEY2_Pin GPIO_PIN_0
#define KEY2_GPIO_Port GPIOE
#define KEY1_Pin GPIO_PIN_1
#define KEY1_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
